# 2. Sentencias de manipulación de datos

* `INSERT`, para insertar; 
* `UPDATE`, para modificar, 
* `DELETE`, para borrar. 

Una vez hemos insertado valores en las tablas, tenemos que poder consultarlos. La sentencia para hacer consultas a una BD con SQL es `SELECT FROM`.

## 2.1. Inserción de filas en una tabla
> `INSERT INTO VALUES`: Antes de poder consultar los datos de una BD, hay que introducir los datos.

In [ ]:
INSERT INFO <nombre_tabla> [(<columna>)]
    {VALUES ({ <v1> | DEFAULT | NULL}, ... , {<vn> | DEFAULT | NULL}) | <consulta>};

Los valores v1, v2..., vn se tienen que corresponder exactamente con las columnas que hemos dicho que tendríamos con el CREATE TABLE, y tienen que estar en el mismo orden, a no ser que las volvamos a poner a continuación del nombre de la tabla. En este último caso, los valores se deben disponer de manera coherente con el nuevo orden que hemos impuesto. 
>Podría ser que quisiéramos que algunos valores a insertar fueran valores por omisión, definidos previamente con la opción DEFAULT. Entonces pondríamos la palabra reservada DEFAULT. Si se trata de introducir valores nulos también podemos usar la palabra reservada NULL.

__INSERCIÓN DE UNA FILA EN `BDUOC` (llamo `public` a la `BDUOC` no sé cómo crear el shquema BDUOC)__

In [1]:
-- connection: postgres://postgres:1234@localhost:5433/postgres

>__PRIMERO CONSULTO EL NOMBRE DE MIS BASES DE DATOS CREADAS EN Lenguaje SQL 1_1__

In [56]:
SELECT table_name              --seleccionamos solo la columna del nombre de la tabla
FROM information_schema.tables --seleccionamos la información del esquema 
WHERE table_schema='public'     --las tablas se encuentran en el esquema publico
AND table_type='BASE TABLE';   --tiene que ser del tipo table ya que aqui se listan tambien las vistas

3 row(s) returned.

table_name
-------------
clientes
departamentos
proyectos

> __CONSULTO EL NOMBRE DE LAS COLUMNAS__:
>Se podría usar la información del esquema para retornar el nombre de las columnas de una tabla especifica, accediendo especificamente a information_schema.columns que tiene los nombres de columna de las tablas:

In [49]:
SELECT column_name, data_type, character_maximum_length	       --Seleccionamos el nombre de columna
FROM information_schema.columns     --Desde information_schema.columns
WHERE table_schema = 'BDUOC'       --En el esquema que tenemos las tablas en este caso public
AND table_name   = 'clientes'       --El nombre de la tabla especifica de la que deseamos obtener información

6 row(s) returned.

column_name    data_type      character_maximum_length
-------------  -----------  --------------------------
codigo_cli     integer
nombre_cli     character                            30
nif            character                            12
direccion      character                            30
ciudad         character                            20
telefono       character                            12

>__INSERTO FILA__ en la tabla `clientes`.

In [23]:
INSERT INTO clientes(codigo_cli, nombre_cli, nif, direccion, ciudad, telefono)
VALUES (10, 'ECIGSA', '37.248.573-C', 'ARAGON 242', 'Barcelona', DEFAULT);

In [57]:
SELECT * FROM clientes

1 row(s) returned.

  codigo_cli  nombre_cli    nif           direccion    ciudad     telefono
------------  ------------  ------------  -----------  ---------  ----------
          10  ECIGSA        37.248.573-C  ARAGON 242   Barcelona

## 2.2. Borrado de filas de una tabla

In [58]:
DELETE FROM clientes
WHERE codigo_cli = 10

In [59]:
SELECT * FROM clientes

0 row(s) returned.

__Borrar todas las filas de una tabla en BDUOC__

In [60]:
DELETE FROM proyectos;

In [61]:
SELECT * FROM proyectos

0 row(s) returned.

## 2.3. Modificación de filas de una tabla

>__Modificación de los valores de algunas filas en BDUOC__  
>Supongamos que los empleados del proyecto con num_proy = 2 pasan a ganar un sueldo más alto. La modificación de esta situación sería:

In [ ]:
UPDATE empleados
SET sueldo = sueldo + 1000.0
WHERE num_proy = 2;

## 2.4. Introducción de filas en la BD relacional BDUOC
Antes de empezar a hacer consultas a la BD BDUOC, habremos introducido unas cuantas filas en sus tablas con la sentencia INSERT INTO.

In [62]:
INSERT INTO clientes(codigo_cli, nombre_cli, nif, direccion, ciudad, telefono)
VALUES  (10, 'ECIGSA', '37.248.573-C', 'ARAGON 242', 'Barcelona', DEFAULT),
        (20, 'CIME', '38.123.898-E', 'Valencia 22', 'Gerona', 972235721),
        (30, 'ACME', '36876325-A', 'Mallorca 43', 'Tarragona', 977263542),
        (40, 'JGM', '34876438-E', 'Rosellon 443', 'Lerida', 876453628);

In [63]:
INSERT INTO departamentos(nombre_dpt, ciudad_dpt, telefono)
VALUES  ('DIR', 'Barcelona', 93876453),
        ('DIR', 'Gerona', 972235721),
        ('DIS', 'Lerida', 977263542),
        ('DIS', 'Barcelona', 876453628),
        ('PROG', 'Tarragona', 977654352),
        ('PROG', 'Gerona', 976543289);

In [73]:
CREATE TABLE empleados(codigo_emp1 INTEGER, 
                       nombre_empl VARCHAR(30), 
                       apellido_empl VARCHAR(30), 
                       sueldo INTEGER, 
                       nombre_dpt VARCHAR(30), 
                       ciudad_dpt VARCHAR(30), 
                       num_proy INTEGER,
                       PRIMARY KEY (codigo_emp1)
                      );

In [74]:
INSERT INTO empleados(codigo_emp1, nombre_empl, apellido_empl, sueldo, nombre_dpt, ciudad_dpt, num_proy)
VALUES  (1, 'Maria', 'Puig', 100000.0, 'DIR', 'Gerona', 1),
        (5, 'Pedro', 'Mas', 90000.0, 'DIR', 'Barcelona', 4),
        (3, 'Ana', 'Ros', 70000.0, 'DIS', 'Lérida', 3),
        (6, 'Jorge', 'Roca', 70000.0, 'DIS', 'Barcelona', 4),
        (2, 'Clara', 'Blanc', 40000.0, 'PROG', 'Tarragona', 1),
        (4, 'Laura', 'Tort', 30000.0, 'PROG', 'Tarragona', 3),
        (7, 'Roger', 'Salt', 40000.0, NULL, NULL, 4),
        (8, 'Sergio', 'Grau', 30000.0, 'PROG', 'Tarragona', NULL);

In [80]:
INSERT INTO proyectos(codigo_proy, nombre_proy, precio, fecha_inicio, fecha_prev_fin, fecha_fin, codigo_cliente)
VALUES  (1, 'GESCOM', 1000000.0, '1998-1-1', '1999-1-1', NULL, 10),
        (2, 'PESCI', 2000000.0, '1996-10-1', '1998-3-31', '1998-5-1', 10),
        (3, 'SALSA', 1000000.0, '1998-2-10', '1999-2-1', NULL, 20),
        (4, 'TINELL', 4000000.0, '1997-1-1', '1999-12-1', NULL, 30)

## 2.5. Consultas a una BD relacional

In [81]:
SELECT * FROM clientes;

4 row(s) returned.

  codigo_cli  nombre_cli    nif           direccion     ciudad         telefono
------------  ------------  ------------  ------------  ---------  ------------
          10  ECIGSA        37.248.573-C  ARAGON 242    Barcelona
          20  CIME          38.123.898-E  Valencia 22   Gerona     972235721
          30  ACME          36876325-A    Mallorca 43   Tarragona  977263542
          40  JGM           34876438-E    Rosellon 443  Lerida     876453628

In [82]:
/*AS nos permite renombrar una columna*/
SELECT nombre_cli AS cliente
FROM clientes;

4 row(s) returned.

cliente
---------
ECIGSA
CIME
ACME
JGM

In [83]:
/*AS nos permite renombrar una columna*/
SELECT nombre_cli AS cliente
FROM clientes AS AMIGOS; /*TAMBIEN PODEMOS RENOMBRAR LA TABLA*/

4 row(s) returned.

cliente
---------
ECIGSA
CIME
ACME
JGM

__BUSCAMOS POR FILAS__
>`WHERE` nos permite buscar por filas añadiendo condiciones específicas.

In [88]:
SELECT codigo_emp1  /*hay fallo: emp1 acaba en uno, cambio empl que acaba en l */
FROM empleados
WHERE num_proy = 4;

3 row(s) returned.

  codigo_emp1
-------------
            5
            6
            7

In [89]:
ALTER TABLE empleados
RENAME COLUMN codigo_emp1 TO new_codigo_empl;

__OPERADORES CONDICIONALES__
>* '=' Igual
>* '<' Menor
>* '>' Mayor
>* '<=' Menor o igual
>* '>=' Mayor o igual
>* '<>' Diferente
>* 'NOT' Para la negación de condiciones
>* 'AND' Para la conjunción de condiciones
>* 'OR' Para la disyunción de condiciones

__SELLECIONANDO FILAS SIN REPETICIONES__

In [90]:
SELECT DISTINCT sueldo
FROM empleados;

5 row(s) returned.

  sueldo
--------
  100000
   30000
   70000
   40000
   90000

### 2.5.1. Funciones de agregación

<img src="img/11.png" width="500">

>En general, las funciones de agregación se aplican a una columna, excepto la función de agregación COUNT, que normalmente se aplica a todas las columnas de la tabla o tablas seleccionadas: 
> * COUNT(*) contaría las filas de la tabla o tablas que cumplan las condiciones, 
> * COUNT(DISTINCT <nombre_columna>) sólo contaría los valores que no fueran nulos ni repetidos, y 
> * COUNT(<nombre_columna>) sólo contaría los valores que no fueran nulos.

In [95]:
/*¿Cuántos departamentos están ubicados en la ciudad de Lérida?*/
SELECT COUNT(*) AS numero_dpt FROM departamentos
WHERE ciudad_dpt = 'Lerida';

1 row(s) returned.

  numero_dpt
------------
           1

### 2.5.2. Subconsultas
>Saber los códigos y los nombres de los proyectos de precio más alto:
>* en primer lugar tendríamos que encontrar los proyectos que tienen el precio más alto. Lo haríamos de la siguiente manera:

In [96]:
SELECT codigo_proy, nombre_proy FROM proyectos
WHERE precio = (
    SELECT MAX(precio) FROM proyectos);

1 row(s) returned.

  codigo_proy  nombre_proy
-------------  -------------
            4  TINELL

### 2.5.3. Otros predicados

__1) BETWEEN__

In [103]:
SELECT codigo_empl
FROM empleados
WHERE sueldo BETWEEN 20000.0 and 50000.0;

4 row(s) returned.

  codigo_empl
-------------
            2
            4
            7
            8

In [100]:
SELECT * FROM empleados

8 row(s) returned.

  new_codigo_empl  nombre_empl    apellido_empl      sueldo  nombre_dpt    ciudad_dpt      num_proy
-----------------  -------------  ---------------  --------  ------------  ------------  ----------
                1  Maria          Puig               100000  DIR           Gerona                 1
                5  Pedro          Mas                 90000  DIR           Barcelona              4
                3  Ana            Ros                 70000  DIS           Lérida                 3
                6  Jorge          Roca                70000  DIS           Barcelona              4
                2  Clara          Blanc               40000  PROG          Tarragona              1
                4  Laura          Tort                30000  PROG          Tarragona              3
                7  Roger          Salt                40000                                       4
                8  Sergio         Grau                30000  PROG          Tarragona

__2) IN__

In [104]:
SELECT nombre_dpt, ciudad_dpt
FROM departamentos
WHERE ciudad_dpt IN ('Lerida', 'Tarragona')

2 row(s) returned.

nombre_dpt    ciudad_dpt
------------  ------------
DIS           Lerida
PROG          Tarragona

__3) Predicado LIKE__   
Los patrones de SQL para expresar características son los siguientes: 
>* Se pone un carácter `_` para cada carácter individual que se quiera considerar.  
>* Se pone un carácter `%` para expresar una secuencia de caracteres, que puede ser ninguna.

Nombres de los empleados que empiezan con la letra J y los proyectos que empiezan por S y tienen cinco letras:
>  
>a) Nombres de empleados que empiezan con la letra J:

In [106]:
SELECT codigo_empl, nombre_empl
FROM empleados
WHERE nombre_empl LIKE 'J%';

1 row(s) returned.

  codigo_empl  nombre_empl
-------------  -------------
            6  Jorge

> b) Proyectos que empiezan por S y tienen cinco letras:

In [118]:
SELECT codigo_proy
FROM proyectos
WHERE nombre_proy LIKE 'P_ _ _ _';

0 row(s) returned.

In [110]:
SELECT * FROM proyectos

4 row(s) returned.

  codigo_proy  nombre_proy      precio  fecha_inicio    fecha_prev_fin    fecha_fin      codigo_cliente
-------------  -------------  --------  --------------  ----------------  -----------  ----------------
            1  GESCOM            1e+06  1998-01-01      1999-01-01                                   10
            2  PESCI             2e+06  1996-10-01      1998-03-31        1998-05-01                 10
            3  SALSA             1e+06  1998-02-10      1999-02-01                                   20
            4  TINELL            4e+06  1997-01-01      1999-12-01                                   30

__4) Predicado IS NULL__

> “Código y el nombre de todos los empleados que no están asignados a ningún proyecto.”

In [119]:
SELECT codigo_empl, nombre_empl FROM empleados
WHERE num_proy IS NULL;

1 row(s) returned.

  codigo_empl  nombre_empl
-------------  -------------
            8  Sergio

__5) Predicados ANY/SOME i ALL__

> `ALL` para encontrar los códigos y los nombres de los proyectos en que los sueldos de todos los empleados asignados son más pequeños que el precio del proyecto.

In [120]:
SELECT codigo_proy, nombre_proy FROM proyectos
WHERE precio > ALL(SELECT sueldo 
                   FROM empleados 
                   WHERE codigo_proy = num_proy);

4 row(s) returned.

  codigo_proy  nombre_proy
-------------  -------------
            1  GESCOM
            2  PESCI
            3  SALSA
            4  TINELL

> `ANY/SOME` para encontrar los códigos y los nombres de los proyectos que tienen algún empleado que gana un sueldo más elevado que el precio del proyecto en el cual trabaja.

In [121]:
SELECT codigo_proy, nombre_proy FROM proyectos
WHERE precio < ANY(SELECT sueldo 
                   FROM empleados
                   WHERE codigo_proy = num_proy);

0 row(s) returned.

__6) Predicado EXISTS__
> Se buscan los códigos y los nombres de los empleados que están asignados a algún pro-
yecto.

In [122]:
SELECT codigo_empl, nombre_empl FROM empleados
WHERE EXISTS (SELECT * 
              FROM proyectos 
              WHERE codigo_proy = num_proy);

7 row(s) returned.

  codigo_empl  nombre_empl
-------------  -------------
            1  Maria
            5  Pedro
            3  Ana
            6  Jorge
            2  Clara
            4  Laura
            7  Roger

### 2.5.4. Ordenación de los datos obtenidos en respuestas a consultas
> nombres de los empleados ordenados según el sueldo que ganan, y si ganan el mismo sueldo, ordenados alfabéticamente por el nombre:

In [123]:
SELECT codigo_empl, nombre_empl, apellido_empl, sueldo
FROM empleados
ORDER BY sueldo, nombre_empl;

8 row(s) returned.

  codigo_empl  nombre_empl    apellido_empl      sueldo
-------------  -------------  ---------------  --------
            4  Laura          Tort                30000
            8  Sergio         Grau                30000
            2  Clara          Blanc               40000
            7  Roger          Salt                40000
            3  Ana            Ros                 70000
            6  Jorge          Roca                70000
            5  Pedro          Mas                 90000
            1  Maria          Puig               100000

In [126]:
SELECT codigo_empl, nombre_empl, apellido_empl, sueldo
FROM empleados
ORDER BY sueldo DESC, nombre_empl;

8 row(s) returned.

  codigo_empl  nombre_empl    apellido_empl      sueldo
-------------  -------------  ---------------  --------
            1  Maria          Puig               100000
            5  Pedro          Mas                 90000
            3  Ana            Ros                 70000
            6  Jorge          Roca                70000
            2  Clara          Blanc               40000
            7  Roger          Salt                40000
            4  Laura          Tort                30000
            8  Sergio         Grau                30000

### 2.5.5. Consultas con agrupación de filas de una tabla
>* `GROUP BY` nos sirve para agrupar filas según las columnas que indique esta cláusula.  
>* `HAVING` especifica condiciones de búsqueda para grupos de filas; lleva a cabo la misma función que antes hacía la cláusula WHERE para las filas de toda la tabla, pero ahora las condiciones se aplican a los grupos obtenidos.

<img src="img/12.png" width="600">

> el sueldo __`medio`__ que ganan los empleados de cada departamento.

In [127]:
SELECT nombre_dpt, ciudad_dpt, AVG(sueldo) AS sueldo_medio
FROM empleados
GROUP BY nombre_dpt, ciudad_dpt;

6 row(s) returned.

nombre_dpt    ciudad_dpt      sueldo_medio
------------  ------------  --------------
                                   40000
DIR           Barcelona            90000
DIS           Lérida               70000
DIS           Barcelona            70000
PROG          Tarragona            33333.3
DIR           Gerona              100000

> “Queremos saber los códigos de los proyectos en los cuales la __`suma`__ de los sueldos de los empleados es mayor de 180.000 euros”:

In [128]:
SELECT num_proy
FROM empleados
GROUP BY num_proy
HAVING SUM(sueldo)>180000.0;

1 row(s) returned.

  num_proy
----------
         4

### 2.5.6. Consultas en más de una tabla

__1) Combinación__
> El NIF del cliente y el código y el precio del proyecto que se desarrolla para el cliente número 20:

In [129]:
SELECT proyectos.codigo_proy, proyectos.precio, clientes.nif
FROM clientes, proyectos
WHERE clientes.codigo_cli = proyectos.codigo_cliente AND
      clientes.codigo_cli = 20;

1 row(s) returned.

  codigo_proy    precio  nif
-------------  --------  ------------
            3     1e+06  38.123.898-E

In [130]:
SELECT p.codigo_proy, p.precio, c.nif, p.codigo_cliente, c.codigo_cli 
FROM clientes c, proyectos p
WHERE c.codigo_cli = p.codigo_cliente AND c.codigo_cli = 20;

1 row(s) returned.

  codigo_proy    precio  nif             codigo_cliente    codigo_cli
-------------  --------  ------------  ----------------  ------------
            3     1e+06  38.123.898-E                20            20

__ON__   
>además de expresar condiciones con la igualdad, en caso de que las columnas que queremos relacionar tengan nombres diferentes, nos ofrece la posibilidad de expresar condiciones con los otros operadores de compara- ción que no sean el de igualdad. Sería lo equivalente a la operación que, en álgebra relacional, hemos llamado θ-combinación (θ-join).

> códigos y los apellidos de los empleados que ganan más que el empleado que tiene por código el número 5.

In [132]:
SELECT e1.codigo_empl, e1.apellido_empl
FROM empleados e1 JOIN empleados e2 
ON e1.sueldo > e2.sueldo
WHERE e2.codigo_empl = 5;

1 row(s) returned.

  codigo_empl  apellido_empl
-------------  ---------------
            1  Puig

__2) Combinación natural__  
>La combinación natural (natural join) de dos tablas consiste, básicamente, igual que en el álgebra relacional, en hacer una __equicombinación entre columnas del mismo nombre y eliminar las columnas repetidas__. La combinación natural, utilizando SQL:1992, se haría de la siguiente manera:

In [134]:
SELECT codigo_empl, nombre_empl
FROM empleados NATURAL JOIN departamentos
WHERE telefono = '972235721';

1 row(s) returned.

  codigo_empl  nombre_empl
-------------  -------------
            1  Maria

>La combinación natural también se podría hacer con la cláusula USING, sólo aplicando la palabra reservada JOIN:

In [136]:
SELECT codigo_empl, nombre_empl
FROM empleados JOIN departamentos USING (nombre_dpt,ciudad_dpt)
WHERE telefono = '972235721';

1 row(s) returned.

  codigo_empl  nombre_empl
-------------  -------------
            1  Maria

__3) Combinación interna y externa__   
  
Cualquier combinación puede ser interna o externa.

>__La combinación interna (inner join)__   
>sólo se queda con las filas que tienen va- lores idénticos en las columnas de las tablas que compara. Esto puede hacer que se pierda alguna fila interesante de alguna de las dos tablas, por ejemplo, porque se encuentra NULL en el momento de hacer la combinación. Su for- mato es el siguiente:

<img src="img/13.png" width="600">

>Quiero relacionar con una combinación natural interna las tablas empleados y departamentos para saber el código y el nombre de todos los empleados y el nombre, la ciudad y el teléfono de todos los departamentos, se tendría que hacer lo siguiente:

In [137]:
SELECT e.codigo_empl, e.nombre_empl, e.nombre_dpt, e.ciudad_dpt, d.telefono
FROM empleados e NATURAL JOIN departamentos d;

6 row(s) returned.

  codigo_empl  nombre_empl    nombre_dpt    ciudad_dpt        telefono
-------------  -------------  ------------  ------------  ------------
            1  Maria          DIR           Gerona        972235721
            5  Pedro          DIR           Barcelona     93876453
            6  Jorge          DIS           Barcelona     876453628
            2  Clara          PROG          Tarragona     977654352
            4  Laura          PROG          Tarragona     977654352
            8  Sergio         PROG          Tarragona     977654352

En el resultado, no sale el empleado número 7, que no está asignado a ningún departa- mento, ni el departamento de programación de Gerona, que no tiene ningún empleado asignado.

>__combinación externa (outer join)__   
> que permite obtener todos los valores de la tabla que hemos puesto a la derecha, o los valores de la que hemos puesto a la izquierda, o todos los valores de ambas tablas. Su formato es el siguiente:

<img src="img/14.png" width="600">

a) Combinación externa izquierda

In [138]:
SELECT e.codigo_empl, e.nombre_empl, e.nombre_dpt, e.ciudad_dpt, d.telefono
FROM empleados e NATURAL LEFT OUTER JOIN departamentos d;

8 row(s) returned.

  codigo_empl  nombre_empl    nombre_dpt    ciudad_dpt        telefono
-------------  -------------  ------------  ------------  ------------
            1  Maria          DIR           Gerona        972235721
            5  Pedro          DIR           Barcelona     93876453
            3  Ana            DIS           Lérida
            6  Jorge          DIS           Barcelona     876453628
            2  Clara          PROG          Tarragona     977654352
            4  Laura          PROG          Tarragona     977654352
            7  Roger
            8  Sergio         PROG          Tarragona     977654352

b) Combinació externa derecha

In [139]:
SELECT e.codigo_empl, e.nombre_empl, e.nombre_dpt, e.ciudad_dpt, d.telefono
FROM empleados e NATURAL RIGHT OUTER JOIN departamentos d;

8 row(s) returned.

  codigo_empl  nombre_empl    nombre_dpt    ciudad_dpt        telefono
-------------  -------------  ------------  ------------  ------------
            1  Maria          DIR           Gerona        972235721
            5  Pedro          DIR           Barcelona     93876453
            6  Jorge          DIS           Barcelona     876453628
            2  Clara          PROG          Tarragona     977654352
            4  Laura          PROG          Tarragona     977654352
            8  Sergio         PROG          Tarragona     977654352
                                                          977263542
                                                          976543289

c) Combinación externa plena

In [140]:
SELECT e.codigo_empl, e.nombre_empl, e.nombre_dpt, e.ciudad_dpt, d.telefono
FROM empleados e NATURAL FULL OUTER JOIN departamentos d;

10 row(s) returned.

  codigo_empl  nombre_empl    nombre_dpt    ciudad_dpt        telefono
-------------  -------------  ------------  ------------  ------------
            1  Maria          DIR           Gerona        972235721
            5  Pedro          DIR           Barcelona     93876453
            3  Ana            DIS           Lérida
            6  Jorge          DIS           Barcelona     876453628
            2  Clara          PROG          Tarragona     977654352
            4  Laura          PROG          Tarragona     977654352
            7  Roger
            8  Sergio         PROG          Tarragona     977654352
                                                          977263542
                                                          976543289

4) Combinaciones con más de dos tablas

In [141]:
SELECT *
FROM empleados, proyectos, clientes
WHERE num_proy = codigo_proy AND codigo_cliente = codigo_cli;

7 row(s) returned.

  codigo_empl  nombre_empl    apellido_empl      sueldo  nombre_dpt    ciudad_dpt      num_proy    codigo_proy  nombre_proy      precio  fecha_inicio    fecha_prev_fin    fecha_fin      codigo_cliente    codigo_cli  nombre_cli    nif           direccion    ciudad         telefono
-------------  -------------  ---------------  --------  ------------  ------------  ----------  -------------  -------------  --------  --------------  ----------------  -----------  ----------------  ------------  ------------  ------------  -----------  ---------  ------------
            1  Maria          Puig               100000  DIR           Gerona                 1              1  GESCOM            1e+06  1998-01-01      1999-01-01                                   10            10  ECIGSA        37.248.573-C  ARAGON 242   Barcelona
            5  Pedro          Mas                 90000  DIR           Barcelona              4              4  TINELL            4e+06  1997-01-01      1999-12-01                                   30            30  ACME          36876325-A    Mallorca 43  Tarragona  977263542
            3  Ana            Ros                 70000  DIS           Lérida                 3              3  SALSA             1e+06  1998-02-10      1999-02-01                                   20            20  CIME          38.123.898-E  Valencia 22  Gerona     972235721
            6  Jorge          Roca                70000  DIS           Barcelona              4              4  TINELL            4e+06  1997-01-01      1999-12-01                                   30            30  ACME          36876325-A    Mallorca 43  Tarragona  977263542
            2  Clara          Blanc               40000  PROG          Tarragona              1              1  GESCOM            1e+06  1998-01-01      1999-01-01                                   10            10  ECIGSA        37.248.573-C  ARAGON 242   Barcelona
            4  Laura          Tort                30000  PROG          Tarragona              3              3  SALSA             1e+06  1998-02-10      1999-02-01                                   20            20  CIME          38.123.898-E  Valencia 22  Gerona     972235721
            7  Roger          Salt                40000                                       4              4  TINELL            4e+06  1997-01-01      1999-12-01                                   30            30  ACME          36876325-A    Mallorca 43  Tarragona  977263542

In [142]:
SELECT *
FROM (empleados JOIN proyectos ON num_proy = codigo_proy)
JOIN clientes ON codigo_cliente = codigo_cli;

7 row(s) returned.

  codigo_empl  nombre_empl    apellido_empl      sueldo  nombre_dpt    ciudad_dpt      num_proy    codigo_proy  nombre_proy      precio  fecha_inicio    fecha_prev_fin    fecha_fin      codigo_cliente    codigo_cli  nombre_cli    nif           direccion    ciudad         telefono
-------------  -------------  ---------------  --------  ------------  ------------  ----------  -------------  -------------  --------  --------------  ----------------  -----------  ----------------  ------------  ------------  ------------  -----------  ---------  ------------
            1  Maria          Puig               100000  DIR           Gerona                 1              1  GESCOM            1e+06  1998-01-01      1999-01-01                                   10            10  ECIGSA        37.248.573-C  ARAGON 242   Barcelona
            5  Pedro          Mas                 90000  DIR           Barcelona              4              4  TINELL            4e+06  1997-01-01      1999-12-01                                   30            30  ACME          36876325-A    Mallorca 43  Tarragona  977263542
            3  Ana            Ros                 70000  DIS           Lérida                 3              3  SALSA             1e+06  1998-02-10      1999-02-01                                   20            20  CIME          38.123.898-E  Valencia 22  Gerona     972235721
            6  Jorge          Roca                70000  DIS           Barcelona              4              4  TINELL            4e+06  1997-01-01      1999-12-01                                   30            30  ACME          36876325-A    Mallorca 43  Tarragona  977263542
            2  Clara          Blanc               40000  PROG          Tarragona              1              1  GESCOM            1e+06  1998-01-01      1999-01-01                                   10            10  ECIGSA        37.248.573-C  ARAGON 242   Barcelona
            4  Laura          Tort                30000  PROG          Tarragona              3              3  SALSA             1e+06  1998-02-10      1999-02-01                                   20            20  CIME          38.123.898-E  Valencia 22  Gerona     972235721
            7  Roger          Salt                40000                                       4              4  TINELL            4e+06  1997-01-01      1999-12-01                                   30            30  ACME          36876325-A    Mallorca 43  Tarragona  977263542

### 2.5.7. La unión

Si se utiliza la opción ALL, aparecen todas las filas obtenidas al hacer la unión. No se escribirá esta opción si se quieren eliminar las filas repetidas. Lo más importante de la unión es que somos nosotros los que tenemos que vigilar que se haga entre columnas definidas sobre dominios compatibles; es decir, que tengan la misma interpretación semántica. Como ya se ha dicho, SQL no ofre- ce herramientas para asegurar la compatibilidad semántica entre columnas.

In [143]:
SELECT ciudad
FROM clientes
UNION
SELECT ciudad_dpt
FROM departamentos;

4 row(s) returned.

ciudad
---------
Tarragona
Barcelona
Lerida
Gerona

### 2.5.8. La intersección
Si se utiliza la opción `ALL` aparecen todas las filas obtenidas al hacer la intersección. No se escribirá esta opción si se quieren eliminar las filas repetidas. Lo más importante de la intersección es que somos nosotros los que tenemos que vigilar que se haga entre columnas definidas sobre dominios compatibles; es decir, que tengan la misma interpretación semántica.
> Se quieren saber todas las ciudades donde hay departamentos en los cuales se puede encontrar algún cliente.

In [144]:
SELECT ciudad
FROM clientes
INTERSECT
SELECT ciudad_dpt
FROM departamentos;

4 row(s) returned.

ciudad
---------
Tarragona
Lerida
Barcelona
Gerona

La intersección es una de las operaciones de SQL que se puede hacer de ma- yor número de maneras diferentes:
* Intersección utilizando IN:

In [149]:
SELECT ciudad
FROM clientes
WHERE ciudad IN (SELECT ciudad_dpt
                     FROM departamentos);

4 row(s) returned.

ciudad
---------
Barcelona
Gerona
Tarragona
Lerida

* Intersección utilizando EXISTS:

In [150]:
SELECT c.ciudad
FROM clientes c
WHERE EXISTS (SELECT *
              FROM departamentos d
              WHERE c.ciudad = d.ciudad_dpt);

4 row(s) returned.

ciudad
---------
Barcelona
Gerona
Tarragona
Lerida

### 2.5.9. La diferencia
Para encontrar la diferencia entre dos o más sentencias SELECT FROM podemos utilizar la cláusula EXCEPT, que tiene este formato:

In [ ]:
SELECT nombre_columnas
FROM tabla
[WHERE condiciones]
EXCEPT [ALL]
SELECT nombre_columnas
FROM tabla
[WHERE condiciones];

Si se utiliza la opción ALL, aparecen todas las filas obtenidas al hacer la dife- rencia. No se escribirá esta opción si se quieren eliminar las filas repetidas. Lo más importante de la diferencia es que somos nosotros los que tenemos que vigilar que se haga entre columnas definidas sobre dominios compatibles.

__Utilización de la diferencia en BDUOC__  
>Se quieren saber los clientes que no han contratado ningún proyecto.

In [151]:
SELECT codigo_cli FROM clientes EXCEPT
SELECT codigo_cliente FROM proyectos;

1 row(s) returned.

  codigo_cli
------------
          40

La diferencia es, junto con la intersección, una de las operaciones de SQL que se puede hacer de más maneras diferentes:
* Diferencia utilizando NOT IN:

In [152]:
SELECT codigo_cli 
FROM clientes
WHERE codigo_cli NOT IN (SELECT codigo_cliente 
                         FROM proyectos);

1 row(s) returned.

  codigo_cli
------------
          40

* o también con NOT EXISTS:

In [153]:
SELECT c.codigo_cli
FROM clientes c
WHERE NOT EXISTS (SELECT *
                  FROM proyectos p
                  WHERE c.codigo_cli = p.codigo_cliente);

1 row(s) returned.

  codigo_cli
------------
          40